README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-06 Mon 01:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title><b>P</b>arallel <b>Auc</b>tion Algorithm</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xin Jin" />
</head>
<body>
<div id="content">
<h1 class="title"><b>P</b>arallel <b>Auc</b>tion Algorithm</h1>
<p>
This is a C++ implementation of a hybrid (with both Gauss-Seidel and Jacobi components) parallel auction algorithm.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Compile</h2>
<div class="outline-text-2" id="text-1">
<p>
To compile, simply execute
</p>
<div class="org-src-container">

<pre class="src src-sh">make
</pre>
</div>
<p>
By default, clang++ is used, and C++14 flag is turned on. To use g++ instead, you can do
</p>
<div class="org-src-container">

<pre class="src src-sh">make <span class="org-variable-name">GCC</span>=1
</pre>
</div>
<p>
To turn on the debug flag <code>-g</code> :
</p>
<div class="org-src-container">

<pre class="src src-sh">make <span class="org-variable-name">PROFILE</span>=1
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Simple Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
This program uses the max-payoff formulation of the linear assignment problem. The min-cost formulation can be easily adapted.
</p>
<div class="org-src-container">

<pre class="src src-sh">bin/pauc [options]
</pre>
</div>
<p>
All options are optinal:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Full Name</th>
<th scope="col" class="org-left">Argument</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-b</code></td>
<td class="org-left"><code>--block</code></td>
<td class="org-left"><code>&lt;nblock&gt;</code></td>
<td class="org-left">Specify the number of partitions/blocks to use for the Gauss-Seidel component. Default is 1.</td>
</tr>

<tr>
<td class="org-left"><code>-f</code></td>
<td class="org-left"><code>--file</code></td>
<td class="org-left"><code>&lt;file&gt;</code></td>
<td class="org-left">Specify the input file. Default is <code>./graph.in</code>.</td>
</tr>

<tr>
<td class="org-left"><code>-i</code></td>
<td class="org-left"><code>--summary</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The output will only be a summary without the full specification of theh optimal assignment.</td>
</tr>

<tr>
<td class="org-left"><code>-n</code></td>
<td class="org-left"><code>--no-print</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">No output will be produced, and this also suppresses the <code>-i</code> option.</td>
</tr>

<tr>
<td class="org-left"><code>-p</code></td>
<td class="org-left"><code>--print-matrix</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Print the full payoff matrix. Disallowed pair is denoted by <code>-</code>.</td>
</tr>

<tr>
<td class="org-left"><code>-s</code></td>
<td class="org-left"><code>--sim</code></td>
<td class="org-left"><code>&lt;nsim&gt;</code></td>
<td class="org-left">Specify the number of bidders to simultaneously update on one iteration (the Jacobi component). Default is 1.</td>
</tr>
</tbody>
</table>

<p>
So far, only edge specification of the graph is accepted: the first line of an input file is <code>n</code>, the number of bidders/items; each of the following lines is of the form <code>i j a</code>, which means the payoff of <code>j</code> to <code>i</code> is <code>a</code>. All edges not present are assumed to be disallowed. See <code>test/graph.in0</code> for an example. Also see the next section for a way to generate a random graph. 
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Test Scripts</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>test/genGraph.py</code> generates a fully dense graph, with each (integer) payoff drawn uniformly from <code>&lt;low&gt;</code> to <code>&lt;high&gt;</code>. All options are optional:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Argument</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-f</code></td>
<td class="org-left"><code>&lt;file&gt;</code></td>
<td class="org-left">Specify the name of the generated file. Default is <code>./graph.in</code>.</td>
</tr>

<tr>
<td class="org-left"><code>h</code></td>
<td class="org-left"><code>&lt;high&gt;</code></td>
<td class="org-left">Specify the maximum payoff. Default is 100.</td>
</tr>

<tr>
<td class="org-left"><code>-l</code></td>
<td class="org-left"><code>&lt;low&gt;</code></td>
<td class="org-left">Specify the minimum payoff. Default is 1.</td>
</tr>

<tr>
<td class="org-left"><code>-n</code></td>
<td class="org-left"><code>&lt;number&gt;</code></td>
<td class="org-left">Specify the number of bidders/items. Default is 100.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
